"""Константы приложения"""

MONTH_NAMES = {
    1: "Январь", 2: "Февраль", 3: "Март", 4: "Апрель",
    5: "Май", 6: "Июнь", 7: "Июль", 8: "Август",
    9: "Сентябрь", 10: "Октябрь", 11: "Ноябрь", 12: "Декабрь"
}

DEFAULT_EMAIL_BODY = (
    "Добрый день!\n\n"
    "Сообщение сформировано автоматически, отвечать на него не нужно.\n\n"
    "Пароль от файлов в скором времени будет направлен вашему Куратору"
)

# Колонки Excel
REQUIRED_COLUMNS = ['email', 'файл_01', 'файл_02', 'файл_03']

# Настройки по умолчанию
DEFAULT_THREAD_COUNT = 3
MIN_THREAD_COUNT = 1
MAX_THREAD_COUNT = 10
DEFAULT_WINDOW_WIDTH = 720
DEFAULT_WINDOW_HEIGHT = 800
